const assetsType = {
    '阀门井': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",
        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",
        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "池（井）体横向截面形状",
            "key": "池（井）体横向截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "深度（m）",
            "key": "深度（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "连通形式",
            "key": "连通形式",

        },
        {
            "name": "阀门井操作形式",
            "key": "阀门井操作形式",

        },
        {
            "name": "是否有阀门套筒",
            "key": "是否有阀门套筒",

        },
        {
            "name": "池（井）体壁厚（mm）",
            "key": "池（井）体壁厚（mm）",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "是否为隐藏井盖",
            "key": "是否为隐藏井盖",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "井盖/盖板载重负荷 （kN）",
            "key": "井盖/盖板载重负荷 （kN）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '检修井': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "池（井）体横向截面形状",
            "key": "池（井）体横向截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "深度（m）",
            "key": "深度（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "检查井等级",
            "key": "检查井等级",

        },
        {
            "name": "连通形式",
            "key": "连通形式",

        },
        {
            "name": "检查井结构形式",
            "key": "检查井结构形式",

        },
        {
            "name": "井底形式",
            "key": "井底形式",

        },
        {
            "name": "井室高度（m）",
            "key": "井室高度（m）",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "井盖厚度（mm）",
            "key": "井盖厚度（mm）",

        },
        {
            "name": "是否为重型井盖",
            "key": "是否为重型井盖",

        },
        {
            "name": "是否为隐藏井盖",
            "key": "是否为隐藏井盖",

        },
        {
            "name": "是否为双层井盖",
            "key": "是否为双层井盖",

        },
        {
            "name": "是否装备链条或锁具",
            "key": "是否装备链条或锁具",

        },
        {
            "name": "其余附属物",
            "key": "其余附属物",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "井盖/盖板载重负荷 （kN）",
            "key": "井盖/盖板载重负荷 （kN）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '绿化水管': [

        {
            "name": "资产标识码",
            "key": "资产标识码",

        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },

        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "输送介质",
            "key": "输送介质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "给水管网敷设形式",
            "key": "给水管网敷设形式",

        },
        {
            "name": "管渠基础",
            "key": "管渠基础",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "外防腐材质",
            "key": "外防腐材质",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "是否有保温层",
            "key": "是否有保温层",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "排气阀数量",
            "key": "排气阀数量",

        },
        {
            "name": "排气阀类型",
            "key": "排气阀类型",

        },
        {
            "name": "排气阀检修阀门数量",
            "key": "排气阀检修阀门数量",

        },
        {
            "name": "是否有排泥放空管",
            "key": "是否有排泥放空管",

        },
        {
            "name": "市政消火栓数量",
            "key": "市政消火栓数量",

        },
        {
            "name": "取水阀门数量",
            "key": "取水阀门数量",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "管道设计水压（MPa）",
            "key": "管道设计水压（MPa）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "压力等级",
            "key": "压力等级",

        },
        {
            "name": "管道防冻参数 ",
            "key": "管道防冻参数 ",

        },
        {
            "name": "管道防压参数 ",
            "key": "管道防压参数 ",

        },
        {
            "name": "抗拉强度（Mpa）",
            "key": "抗拉强度（Mpa）",

        },
        {
            "name": "下屈服强度（Mpa）",
            "key": "下屈服强度（Mpa）",

        },
        {
            "name": "断裂伸长率（%）",
            "key": "断裂伸长率（%）",

        },
        {
            "name": "氧化诱导时间（200℃）",
            "key": "氧化诱导时间（200℃）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '排泥湿井': [
        {
            "name": "资产标识码",
            "key": "assetsId",

        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "X坐标",
            "key": "xCoordinate",

        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",

        },
        {
            "name": "高程",
            "key": "高程",

        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "池（井）体横向截面形状",
            "key": "池（井）体横向截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "深度（m）",
            "key": "深度（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "连通形式",
            "key": "连通形式",

        },
        {
            "name": "检查井结构形式",
            "key": "检查井结构形式",

        },
        {
            "name": "井底形式",
            "key": "井底形式",

        },
        {
            "name": "井室高度（m）",
            "key": "井室高度（m）",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "井盖厚度（mm）",
            "key": "井盖厚度（mm）",

        },
        {
            "name": "是否为重型井盖",
            "key": "是否为重型井盖",

        },
        {
            "name": "是否为隐藏井盖",
            "key": "是否为隐藏井盖",

        },
        {
            "name": "是否为双层井盖",
            "key": "是否为双层井盖",

        },
        {
            "name": "是否为智能井盖",
            "key": "是否为智能井盖",

        },
        {
            "name": "排泥方式",
            "key": "排泥方式",

        },
        {
            "name": "是否配套防臭、防爆、防坠和防撞击措施",
            "key": "是否配套防臭、防爆、防坠和防撞击措施",

        },
        {
            "name": "是否装备链条或锁具",
            "key": "是否装备链条或锁具",

        },
        {
            "name": "其余附属物",
            "key": "其余附属物",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "井盖/盖板载重负荷 （kN）",
            "key": "井盖/盖板载重负荷 （kN）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '配水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },

        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        }
    ],
    '其他建（构）筑物': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",
            "required": true
        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "建筑物规格",
            "key": "建筑物规格",

        },
        {
            "name": "层数",
            "key": "层数",

        },
        {
            "name": "建筑面积（m²）",
            "key": "建筑面积（m²）",

        },
        {
            "name": "截面形状",
            "key": "截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "底部标高（m）",
            "key": "底部标高（m）",

        },
        {
            "name": "顶部标高（m）",
            "key": "顶部标高（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "是否为重型井盖",
            "key": "是否为重型井盖",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "结构安全等级",
            "key": "结构安全等级",

        },
        {
            "name": "抗震设防烈度",
            "key": "抗震设防烈度",

        },
        {
            "name": "耐火等级",
            "key": "耐火等级",

        },
        {
            "name": "防水等级",
            "key": "防水等级",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '生态补水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },

        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "输送介质",
            "key": "输送介质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "给水管网敷设形式",
            "key": "给水管网敷设形式",

        },
        {
            "name": "管渠基础",
            "key": "管渠基础",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "外防腐材质",
            "key": "外防腐材质",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "是否有保温层",
            "key": "是否有保温层",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "排气阀数量",
            "key": "排气阀数量",

        },
        {
            "name": "排气阀类型",
            "key": "排气阀类型",

        },
        {
            "name": "排气阀检修阀门数量",
            "key": "排气阀检修阀门数量",

        },
        {
            "name": "是否有排泥放空管",
            "key": "是否有排泥放空管",

        },
        {
            "name": "市政消火栓数量",
            "key": "市政消火栓数量",

        },
        {
            "name": "取水阀门数量",
            "key": "取水阀门数量",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "管道设计水压（MPa）",
            "key": "管道设计水压（MPa）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "压力等级",
            "key": "压力等级",

        },
        {
            "name": "管道防冻参数 ",
            "key": "管道防冻参数 ",

        },
        {
            "name": "管道防压参数 ",
            "key": "管道防压参数 ",

        },
        {
            "name": "抗拉强度（Mpa）",
            "key": "抗拉强度（Mpa）",

        },
        {
            "name": "下屈服强度（Mpa）",
            "key": "下屈服强度（Mpa）",

        },
        {
            "name": "断裂伸长率（%）",
            "key": "断裂伸长率（%）",

        },
        {
            "name": "氧化诱导时间（200℃）",
            "key": "氧化诱导时间（200℃）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '输水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },

        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "给水用途",
            "key": "给水用途",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "给水管网敷设形式",
            "key": "给水管网敷设形式",

        },
        {
            "name": "管渠基础",
            "key": "管渠基础",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "外防腐材质",
            "key": "外防腐材质",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "是否有保温层",
            "key": "是否有保温层",

        },
        {
            "name": "是否热水管",
            "key": "是否热水管",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "排气阀数量",
            "key": "排气阀数量",

        },
        {
            "name": "排气阀类型",
            "key": "排气阀类型",

        },
        {
            "name": "排气阀检修阀门数量",
            "key": "排气阀检修阀门数量",

        },
        {
            "name": "是否有排泥放空管",
            "key": "是否有排泥放空管",

        },
        {
            "name": "市政消火栓数量",
            "key": "市政消火栓数量",

        },
        {
            "name": "取水阀门数量",
            "key": "取水阀门数量",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "管道设计水压（MPa）",
            "key": "管道设计水压（MPa）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "压力等级",
            "key": "压力等级",

        },
        {
            "name": "管道防冻参数 ",
            "key": "管道防冻参数 ",

        },
        {
            "name": "管道防压参数 ",
            "key": "管道防压参数 ",

        },
        {
            "name": "抗拉强度（Mpa）",
            "key": "抗拉强度（Mpa）",

        },
        {
            "name": "下屈服强度（Mpa）",
            "key": "下屈服强度（Mpa）",

        },
        {
            "name": "断裂伸长率（%）",
            "key": "断裂伸长率（%）",

        },
        {
            "name": "氧化诱导时间（200℃）",
            "key": "氧化诱导时间（200℃）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '水表井': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "池（井）体横向截面形状",
            "key": "池（井）体横向截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "深度（m）",
            "key": "深度（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管理归属",
            "key": "管理归属",

        },
        {
            "name": "连通形式",
            "key": "连通形式",

        },
        {
            "name": "池（井）体壁厚（mm）",
            "key": "池（井）体壁厚（mm）",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "是否为隐藏井盖",
            "key": "是否为隐藏井盖",

        },
        {
            "name": "水表是否电动",
            "key": "水表是否电动",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "井盖/盖板载重负荷 （kN）",
            "key": "井盖/盖板载重负荷 （kN）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '水源井': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "竖向位置或安装形式",
            "key": "竖向位置或安装形式",

        },
        {
            "name": "池（井）体横向截面形状",
            "key": "池（井）体横向截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "深度（m）",
            "key": "深度（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "水源井深度等级",
            "key": "水源井深度等级",

        },
        {
            "name": "水源井抽水形式",
            "key": "水源井抽水形式",

        },
        {
            "name": "池（井）体壁厚（mm）",
            "key": "池（井）体壁厚（mm）",

        },
        {
            "name": "取水口布置形式",
            "key": "取水口布置形式",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "是否为隐藏井盖",
            "key": "是否为隐藏井盖",

        },
        {
            "name": "是否配套防臭、防爆、防坠和防撞击措施",
            "key": "是否配套防臭、防爆、防坠和防撞击措施",

        },
        {
            "name": "是否装备链条或锁具",
            "key": "是否装备链条或锁具",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "井盖/盖板载重负荷 （kN）",
            "key": "井盖/盖板载重负荷 （kN）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        },
        {
            "name": "上游来水",
            "key": "上游来水",

        }
    ],
    '消防井': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "池（井）体横向截面形状",
            "key": "池（井）体横向截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "深度（m）",
            "key": "深度（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "连通形式",
            "key": "连通形式",

        },
        {
            "name": "检查井结构形式",
            "key": "检查井结构形式",

        },
        {
            "name": "井室高度（m）",
            "key": "井室高度（m）",

        },
        {
            "name": "消防井类别",
            "key": "消防井类别",

        },
        {
            "name": "取水口布置形式",
            "key": "取水口布置形式",

        },
        {
            "name": "取水口数量",
            "key": "取水口数量",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "井盖厚度（mm）",
            "key": "井盖厚度（mm）",

        },
        {
            "name": "是否为重型井盖",
            "key": "是否为重型井盖",

        },
        {
            "name": "是否为隐藏井盖",
            "key": "是否为隐藏井盖",

        },
        {
            "name": "是否为双层井盖",
            "key": "是否为双层井盖",

        },
        {
            "name": "是否装备链条或锁具",
            "key": "是否装备链条或锁具",

        },
        {
            "name": "其余附属物",
            "key": "其余附属物",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "井盖/盖板载重负荷 （kN）",
            "key": "井盖/盖板载重负荷 （kN）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '消防水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },

        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "输送介质",
            "key": "输送介质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "给水管网敷设形式",
            "key": "给水管网敷设形式",

        },
        {
            "name": "管渠基础",
            "key": "管渠基础",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "外防腐材质",
            "key": "外防腐材质",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "是否有保温层",
            "key": "是否有保温层",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "消防给水压力类型",
            "key": "消防给水压力类型",

        },
        {
            "name": "排气阀数量",
            "key": "排气阀数量",

        },
        {
            "name": "排气阀类型",
            "key": "排气阀类型",

        },
        {
            "name": "排气阀检修阀门数量",
            "key": "排气阀检修阀门数量",

        },
        {
            "name": "是否有排泥放空管",
            "key": "是否有排泥放空管",

        },
        {
            "name": "市政消火栓数量",
            "key": "市政消火栓数量",

        },
        {
            "name": "取水阀门数量",
            "key": "取水阀门数量",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "管道设计水压（MPa）",
            "key": "管道设计水压（MPa）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "压力等级",
            "key": "压力等级",

        },
        {
            "name": "管道防冻参数 ",
            "key": "管道防冻参数 ",

        },
        {
            "name": "管道防压参数 ",
            "key": "管道防压参数 ",

        },
        {
            "name": "抗拉强度（Mpa）",
            "key": "抗拉强度（Mpa）",

        },
        {
            "name": "下屈服强度（Mpa）",
            "key": "下屈服强度（Mpa）",

        },
        {
            "name": "断裂伸长率（%）",
            "key": "断裂伸长率（%）",

        },
        {
            "name": "氧化诱导时间（200℃）",
            "key": "氧化诱导时间（200℃）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '循环水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },

        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "输送介质",
            "key": "输送介质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "给水管网敷设形式",
            "key": "给水管网敷设形式",

        },
        {
            "name": "管渠基础",
            "key": "管渠基础",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "外防腐材质",
            "key": "外防腐材质",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "是否有保温层",
            "key": "是否有保温层",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "排气阀数量",
            "key": "排气阀数量",

        },
        {
            "name": "排气阀类型",
            "key": "排气阀类型",

        },
        {
            "name": "排气阀检修阀门数量",
            "key": "排气阀检修阀门数量",

        },
        {
            "name": "是否有排泥放空管",
            "key": "是否有排泥放空管",

        },
        {
            "name": "市政消火栓数量",
            "key": "市政消火栓数量",

        },
        {
            "name": "取水阀门数量",
            "key": "取水阀门数量",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "管道设计水压（MPa）",
            "key": "管道设计水压（MPa）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "压力等级",
            "key": "压力等级",

        },
        {
            "name": "管道防冻参数 ",
            "key": "管道防冻参数 ",

        },
        {
            "name": "管道防压参数 ",
            "key": "管道防压参数 ",

        },
        {
            "name": "抗拉强度（Mpa）",
            "key": "抗拉强度（Mpa）",

        },
        {
            "name": "下屈服强度（Mpa）",
            "key": "下屈服强度（Mpa）",

        },
        {
            "name": "断裂伸长率（%）",
            "key": "断裂伸长率（%）",

        },
        {
            "name": "氧化诱导时间（200℃）",
            "key": "氧化诱导时间（200℃）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '原水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "输送介质",
            "key": "输送介质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "给水管网敷设形式",
            "key": "给水管网敷设形式",

        },
        {
            "name": "管渠基础",
            "key": "管渠基础",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "管道设计水压（MPa）",
            "key": "管道设计水压（MPa）",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        }
    ],
    '直饮水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },

        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "给水管网敷设形式",
            "key": "给水管网敷设形式",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠基础",
            "key": "管渠基础",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "外防腐材质",
            "key": "外防腐材质",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "是否有保温层",
            "key": "是否有保温层",

        },
        {
            "name": "是否热水管",
            "key": "是否热水管",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "排气阀数量",
            "key": "排气阀数量",

        },
        {
            "name": "排气阀类型",
            "key": "排气阀类型",

        },
        {
            "name": "排气阀检修阀门数量",
            "key": "排气阀检修阀门数量",

        },
        {
            "name": "是否有排泥放空管",
            "key": "是否有排泥放空管",

        },
        {
            "name": "市政消火栓数量",
            "key": "市政消火栓数量",

        },
        {
            "name": "取水阀门数量",
            "key": "取水阀门数量",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "管道设计水压（MPa）",
            "key": "管道设计水压（MPa）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "压力等级",
            "key": "压力等级",

        },
        {
            "name": "管道防冻参数 ",
            "key": "管道防冻参数 ",

        },
        {
            "name": "管道防压参数 ",
            "key": "管道防压参数 ",

        },
        {
            "name": "抗拉强度（Mpa）",
            "key": "抗拉强度（Mpa）",

        },
        {
            "name": "下屈服强度（Mpa）",
            "key": "下屈服强度（Mpa）",

        },
        {
            "name": "断裂伸长率（%）",
            "key": "断裂伸长率（%）",

        },
        {
            "name": "氧化诱导时间（200℃）",
            "key": "氧化诱导时间（200℃）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '中水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },

        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "给水用途",
            "key": "给水用途",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "给水管网敷设形式",
            "key": "给水管网敷设形式",

        },
        {
            "name": "管渠基础",
            "key": "管渠基础",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "外防腐材质",
            "key": "外防腐材质",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "是否有保温层",
            "key": "是否有保温层",

        },
        {
            "name": "是否热水管",
            "key": "是否热水管",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "排气阀数量",
            "key": "排气阀数量",

        },
        {
            "name": "排气阀类型",
            "key": "排气阀类型",

        },
        {
            "name": "排气阀检修阀门数量",
            "key": "排气阀检修阀门数量",

        },
        {
            "name": "是否有排泥放空管",
            "key": "是否有排泥放空管",

        },
        {
            "name": "市政消火栓数量",
            "key": "市政消火栓数量",

        },
        {
            "name": "取水阀门数量",
            "key": "取水阀门数量",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "管道设计水压（MPa）",
            "key": "管道设计水压（MPa）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "压力等级",
            "key": "压力等级",

        },
        {
            "name": "管道防冻参数 ",
            "key": "管道防冻参数 ",

        },
        {
            "name": "管道防压参数 ",
            "key": "管道防压参数 ",

        },
        {
            "name": "抗拉强度（Mpa）",
            "key": "抗拉强度（Mpa）",

        },
        {
            "name": "下屈服强度（Mpa）",
            "key": "下屈服强度（Mpa）",

        },
        {
            "name": "断裂伸长率（%）",
            "key": "断裂伸长率（%）",

        },
        {
            "name": "氧化诱导时间（200℃）",
            "key": "氧化诱导时间（200℃）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '给水管网及附属设施': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "范围坐标",
            "key": "范围坐标",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "所属工程",
            "key": "所属工程",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "行政区划",
            "key": "行政区划",

        },
        {
            "name": "给水系统类型",
            "key": "给水系统类型",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计流量（m³/h）",
            "key": "设计流量（m³/h）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "控制点水压（MPa）",
            "key": "控制点水压（MPa）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        },
        {
            "name": "服务范围",
            "key": "服务范围",

        },
        {
            "name": "服务面积（km²）",
            "key": "服务面积（km²）",

        },
        {
            "name": "服务人口数",
            "key": "服务人口数",

        }
    ],
    '合流管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "特殊管渠类型",
            "key": "特殊管渠类型",

        },
        {
            "name": "排水管网敷设形式",
            "key": "排水管网敷设形式",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠坡度（‰）",
            "key": "管渠坡度（‰）",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "截流能力（mm/h）",
            "key": "截流能力（mm/h）",

        },
        {
            "name": "截流倍数",
            "key": "截流倍数",

        },
        {
            "name": "设计重现期",
            "key": "设计重现期",

        },
        {
            "name": "设计降雨量（mm）",
            "key": "设计降雨量（mm）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        },
        {
            "name": "服务范围",
            "key": "服务范围",

        },
        {
            "name": "服务面积（km²）",
            "key": "服务面积（km²）",

        }
    ],
    '检查井': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "排水系统类型",
            "key": "排水系统类型",

        },
        {
            "name": "池（井）体横向截面形状",
            "key": "池（井）体横向截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "深度（m）",
            "key": "深度（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "检查井类型",
            "key": "检查井类型",

        },
        {
            "name": "管理归属",
            "key": "管理归属",

        },
        {
            "name": "检查井等级",
            "key": "检查井等级",

        },
        {
            "name": "连通形式",
            "key": "连通形式",

        },
        {
            "name": "检查井结构形式",
            "key": "检查井结构形式",

        },
        {
            "name": "井底形式",
            "key": "井底形式",

        },
        {
            "name": "井室高度（m）",
            "key": "井室高度（m）",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "井盖厚度（mm）",
            "key": "井盖厚度（mm）",

        },
        {
            "name": "是否为重型井盖",
            "key": "是否为重型井盖",

        },
        {
            "name": "是否为隐藏井盖",
            "key": "是否为隐藏井盖",

        },
        {
            "name": "是否为双层井盖",
            "key": "是否为双层井盖",

        },
        {
            "name": "是否为智能井盖",
            "key": "是否为智能井盖",

        },
        {
            "name": "是否配套防臭、防爆、防坠和防撞击措施",
            "key": "是否配套防臭、防爆、防坠和防撞击措施",

        },
        {
            "name": "是否装备链条或锁具",
            "key": "是否装备链条或锁具",

        },
        {
            "name": "其余附属物",
            "key": "其余附属物",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "井盖/盖板载重负荷 （kN）",
            "key": "井盖/盖板载重负荷 （kN）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        },
        {
            "name": "排水户名称",
            "key": "排水户名称",

        }
    ],
    '截流井': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "排水系统类型",
            "key": "排水系统类型",

        },
        {
            "name": "池（井）体横向截面形状",
            "key": "池（井）体横向截面形状",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "检查井等级",
            "key": "检查井等级",

        },
        {
            "name": "连通形式",
            "key": "连通形式",

        },
        {
            "name": "检查井结构形式",
            "key": "检查井结构形式",

        },
        {
            "name": "井底形式",
            "key": "井底形式",

        },
        {
            "name": "截流井井深（m）",
            "key": "截流井井深（m）",

        },
        {
            "name": "舱室数量",
            "key": "舱室数量",

        },
        {
            "name": "直径（mm）",
            "key": "直径（mm）",

        },
        {
            "name": "前舱室净空规格（mm）",
            "key": "前舱室净空规格（mm）",

        },
        {
            "name": "后舱室净空规格（mm）",
            "key": "后舱室净空规格（mm）",

        },
        {
            "name": "防倒灌预留洞口底标高（m）",
            "key": "防倒灌预留洞口底标高（m）",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "井盖厚度（mm）",
            "key": "井盖厚度（mm）",

        },
        {
            "name": "井盖/盖板数量",
            "key": "井盖/盖板数量",

        },
        {
            "name": "是否配套防臭、防爆、防坠和防撞击措施",
            "key": "是否配套防臭、防爆、防坠和防撞击措施",

        },
        {
            "name": "是否设置截污调控装置",
            "key": "是否设置截污调控装置",

        },
        {
            "name": "是否装备拦渣/过滤装置",
            "key": "是否装备拦渣/过滤装置",

        },
        {
            "name": "是否装备链条或锁具",
            "key": "是否装备链条或锁具",

        },
        {
            "name": "是否有检修口/闸门",
            "key": "是否有检修口/闸门",

        },
        {
            "name": "其余附属物",
            "key": "其余附属物",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "截流倍数",
            "key": "截流倍数",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        },
        {
            "name": "下游去向",
            "key": "下游去向",

        },
        {
            "name": "供电设施标识码",
            "key": "供电设施标识码",

        },
        {
            "name": "排水户名称",
            "key": "排水户名称",

        }
    ],
    '截污管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "特殊管渠类型",
            "key": "特殊管渠类型",

        },
        {
            "name": "排水管网敷设形式",
            "key": "排水管网敷设形式",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠坡度（‰）",
            "key": "管渠坡度（‰）",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "设计重现期",
            "key": "设计重现期",

        },
        {
            "name": "设计降雨量（mm）",
            "key": "设计降雨量（mm）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        },
        {
            "name": "服务范围",
            "key": "服务范围",

        },
        {
            "name": "服务人口数",
            "key": "服务人口数",

        }
    ],
    '排水口': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "周边情况",
            "key": "周边情况",

        },
        {
            "name": "排水系统类型",
            "key": "排水系统类型",

        },
        {
            "name": "截面形状",
            "key": "截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "底部标高（m）",
            "key": "底部标高（m）",

        },
        {
            "name": "顶部标高（m）",
            "key": "顶部标高（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "取水口/排水口内底部与河底高差（m）",
            "key": "取水口/排水口内底部与河底高差（m）",

        },
        {
            "name": "排水口类型",
            "key": "排水口类型",

        },
        {
            "name": "排水口位置",
            "key": "排水口位置",

        },
        {
            "name": "排水口形式",
            "key": "排水口形式",

        },
        {
            "name": "出流形式",
            "key": "出流形式",

        },
        {
            "name": "挡墙形式",
            "key": "挡墙形式",

        },
        {
            "name": "是否装备排放头",
            "key": "是否装备排放头",

        },
        {
            "name": "是否配套防臭、防爆、防坠和防撞击措施",
            "key": "是否配套防臭、防爆、防坠和防撞击措施",

        },
        {
            "name": "是否装备拦渣/过滤装置",
            "key": "是否装备拦渣/过滤装置",

        },
        {
            "name": "其余附属物",
            "key": "其余附属物",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "设计流量（m³/h）",
            "key": "设计流量（m³/h）",

        },
        {
            "name": "常水位（m）",
            "key": "常水位（m）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '其他建（构）筑物': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "建筑物规格",
            "key": "建筑物规格",

        },
        {
            "name": "层数",
            "key": "层数",

        },
        {
            "name": "建筑面积（m²）",
            "key": "建筑面积（m²）",

        },
        {
            "name": "截面形状",
            "key": "截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "底部标高（m）",
            "key": "底部标高（m）",

        },
        {
            "name": "顶部标高（m）",
            "key": "顶部标高（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "井盖/盖板形状",
            "key": "井盖/盖板形状",

        },
        {
            "name": "井盖/盖板规格（mm）",
            "key": "井盖/盖板规格（mm）",

        },
        {
            "name": "井盖/盖板材质",
            "key": "井盖/盖板材质",

        },
        {
            "name": "是否为重型井盖",
            "key": "是否为重型井盖",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "结构安全等级",
            "key": "结构安全等级",

        },
        {
            "name": "抗震设防烈度",
            "key": "抗震设防烈度",

        },
        {
            "name": "耐火等级",
            "key": "耐火等级",

        },
        {
            "name": "防水等级",
            "key": "防水等级",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '污水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },

        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "特殊管渠类型",
            "key": "特殊管渠类型",

        },
        {
            "name": "排水管网敷设形式",
            "key": "排水管网敷设形式",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠坡度（‰）",
            "key": "管渠坡度（‰）",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        },
        {
            "name": "服务范围",
            "key": "服务范围",

        },
        {
            "name": "服务人口数",
            "key": "服务人口数",

        }
    ],
    '雨水管': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
            "required": true
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "管渠类型",
            "key": "管渠类型",

        },
        {
            "name": "特殊管渠类型",
            "key": "特殊管渠类型",

        },
        {
            "name": "排水管网敷设形式",
            "key": "排水管网敷设形式",

        },
        {
            "name": "管渠长度 （m)",
            "key": "管渠长度 （m)",

        },
        {
            "name": "管渠起点埋深（m）",
            "key": "管渠起点埋深（m）",

        },
        {
            "name": "管渠终点埋深（m）",
            "key": "管渠终点埋深（m）",

        },
        {
            "name": "管底起点标高 （m)",
            "key": "管底起点标高 （m)",

        },
        {
            "name": "管底终点标高 （m)",
            "key": "管底终点标高 （m)",

        },
        {
            "name": "管渠坡度（‰）",
            "key": "管渠坡度（‰）",

        },
        {
            "name": "管渠断面形状",
            "key": "管渠断面形状",

        },
        {
            "name": "管径（mm）",
            "key": "管径（mm）",

        },
        {
            "name": "管渠断面数据1（mm）",
            "key": "管渠断面数据1（mm）",

        },
        {
            "name": "管渠断面数据2（mm）",
            "key": "管渠断面数据2（mm）",

        },
        {
            "name": "管渠断面数据3（mm）",
            "key": "管渠断面数据3（mm）",

        },
        {
            "name": "管渠断面数据4（mm）",
            "key": "管渠断面数据4（mm）",

        },
        {
            "name": "管渠壁厚（mm） ",
            "key": "管渠壁厚（mm） ",

        },
        {
            "name": "管渠断面面积（m²）",
            "key": "管渠断面面积（m²）",

        },
        {
            "name": "管渠材质 ",
            "key": "管渠材质 ",

        },
        {
            "name": "管渠衬里材质 ",
            "key": "管渠衬里材质 ",

        },
        {
            "name": "衬里厚度（mm）",
            "key": "衬里厚度（mm）",

        },
        {
            "name": "接头型式 ",
            "key": "接头型式 ",

        },
        {
            "name": "连接方式 ",
            "key": "连接方式 ",

        },
        {
            "name": "敷设方式 ",
            "key": "敷设方式 ",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "设计最小流速（m/s）",
            "key": "设计最小流速（m/s）",

        },
        {
            "name": "设计重现期",
            "key": "设计重现期",

        },
        {
            "name": "设计降雨量（mm）",
            "key": "设计降雨量（mm）",

        },
        {
            "name": "管渠糙率 ",
            "key": "管渠糙率 ",

        },
        {
            "name": "允许荷载压力（MPa）",
            "key": "允许荷载压力（MPa）",

        },
        {
            "name": "最小径向刚度（KN/m²）",
            "key": "最小径向刚度（KN/m²）",

        },
        {
            "name": "土质",
            "key": "土质",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        },
        {
            "name": "服务范围",
            "key": "服务范围",

        },
        {
            "name": "服务面积（km²）",
            "key": "服务面积（km²）",

        }
    ],
    '雨水口': [
        {
            "name": "资产标识码",
            "key": "assetsId",
            "required": true
        },
        {
            "name": "资产名称",
            "key": "资产名称",
        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        },
        {
            "name": "所属标识码",
            "key": "所属标识码",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "供应商",
            "key": "供应商",

        },
        {
            "name": "厂家",
            "key": "厂家",

        },
        {
            "name": "地区类型",
            "key": "地区类型",

        },
        {
            "name": "所处位置",
            "key": "所处位置",

        },
        {
            "name": "布置位置",
            "key": "布置位置",

        },
        {
            "name": "地址描述",
            "key": "地址描述",

        },
        {
            "name": "截面形状",
            "key": "截面形状",

        },
        {
            "name": "截面尺寸1（mm）",
            "key": "截面尺寸1（mm）",

        },
        {
            "name": "截面尺寸2（mm）",
            "key": "截面尺寸2（mm）",

        },
        {
            "name": "深度（m）",
            "key": "深度（m）",

        },
        {
            "name": "主体材质",
            "key": "主体材质",

        },
        {
            "name": "型号",
            "key": "型号",

        },
        {
            "name": "产地",
            "key": "产地",

        },
        {
            "name": "联系人",
            "key": "联系人",

        },
        {
            "name": "联系电话",
            "key": "联系电话",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "雨水口型式 ",
            "key": "雨水口型式 ",

        },
        {
            "name": "雨水篦材质 ",
            "key": "雨水篦材质 ",

        },
        {
            "name": "雨水篦尺寸 1 （mm）",
            "key": "雨水篦尺寸 1 （mm）",

        },
        {
            "name": "雨水篦尺寸 2 （mm）",
            "key": "雨水篦尺寸 2 （mm）",

        },
        {
            "name": "雨水篦间距 （mm）",
            "key": "雨水篦间距 （mm）",

        },
        {
            "name": "雨水篦厚度 （mm）",
            "key": "雨水篦厚度 （mm）",

        },
        {
            "name": "雨水篦数量",
            "key": "雨水篦数量",

        },
        {
            "name": "是否配套防臭、防爆、防坠和防撞击措施",
            "key": "是否配套防臭、防爆、防坠和防撞击措施",

        },
        {
            "name": "是否装备拦渣/过滤装置",
            "key": "是否装备拦渣/过滤装置",

        },
        {
            "name": "是否装备初期雨水截流装置",
            "key": "是否装备初期雨水截流装置",

        },
        {
            "name": "其余附属物",
            "key": "其余附属物",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "设计使用年限（年）",
            "key": "设计使用年限（年）",

        },
        {
            "name": "过流能力（L/s）",
            "key": "过流能力（L/s）",

        },
        {
            "name": "雨水篦载重负荷（KN）",
            "key": "雨水篦载重负荷（KN）",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        }
    ],
    '排水管网及附属设施': [
        {
            "name": "资产标识码",
            "key": "资产标识码",

        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "备注",
            "key": "备注",

        },
        {
            "name": "范围坐标",
            "key": "范围坐标",

        },
        {
            "name": "关联资产标识码",
            "key": "关联资产标识码",

        },
        {
            "name": "设施状态",
            "key": "设施状态",

        },
        {
            "name": "所属工程",
            "key": "所属工程",

        },
        {
            "name": "竣工日期",
            "key": "竣工日期",

        },
        {
            "name": "建设年代",
            "key": "建设年代",

        },
        {
            "name": "扩建日期",
            "key": "扩建日期",

        },
        {
            "name": "改建日期",
            "key": "改建日期",

        },
        {
            "name": "试运营日期",
            "key": "试运营日期",

        },
        {
            "name": "正式运营日期",
            "key": "正式运营日期",

        },
        {
            "name": "主管单位",
            "key": "主管单位",

        },
        {
            "name": "设计单位",
            "key": "设计单位",

        },
        {
            "name": "施工单位",
            "key": "施工单位",

        },
        {
            "name": "监理单位",
            "key": "监理单位",

        },
        {
            "name": "运营委托服务商",
            "key": "运营委托服务商",

        },
        {
            "name": "行政区划",
            "key": "行政区划",

        },
        {
            "name": "排水系统类型",
            "key": "排水系统类型",

        },
        {
            "name": "资产原值（万元）",
            "key": "资产原值（万元）",

        },
        {
            "name": "资产现值（万元）",
            "key": "资产现值（万元）",

        },
        {
            "name": "其他属性参数",
            "key": "其他属性参数",

        },
        {
            "name": "其他技术参数",
            "key": "其他技术参数",

        },
        {
            "name": "所在分区",
            "key": "所在分区",

        },
        {
            "name": "服务范围",
            "key": "服务范围",

        },
        {
            "name": "服务面积（km²）",
            "key": "服务面积（km²）",

        },
        {
            "name": "服务人口数",
            "key": "服务人口数",

        }
    ],
    '初始管点': [
        {
            "name": "资产标识码",
            "key": "assetsId",
         },
        {
            "name": "资产名称",
            "key": "资产名称",
        },
        {
            "name": "X坐标",
            "key": "xCoordinate",
            "required": true
        },
        {
            "name": "Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "高程",
            "key": "高程",
        }

    ],
    '初始管段': [
        {
            "name": "资产标识码",
            "key": "资产标识码",
        },
        {
            "name": "资产名称",
            "key": "资产名称",

        },
        {
            "name": "起始X坐标",
            "key": "xCoordinate",
            "required": true,
        },
        {
            "name": "起始Y坐标",
            "key": "yCoordinate",
            "required": true
        },
        {
            "name": "终止X坐标",
            "key": "xCoordinate2",
            "required": true
        },
        {
            "name": "终止Y坐标",
            "key": "yCoordinate2",
            "required": true
        },
        {
            "name": "开始资产",
            "key": "assetsId",
        },
        {
            "name": "结束资产",
            "key": "assetsId2",
        },
      ]
}



export {
    assetsType
}
